party_app/app/controllers/main_controller.rb

SELECT "snacks".* FROM "snacks" WHERE "snacks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "entertainments".* FROM "entertainments" WHERE "entertainments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "party_supplies".* FROM "party_supplies" WHERE "party_supplies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def results
        # Budget
        @budget = 1000000
        # Number of Guests
        @guests = 250

        # Average Price per person
        @ppp = @budget.to_f / @guests.to_f


        # drinks: 20%
        # meals: 20%
        # snacks: 20%
        # entertainment: 30%
        # party supplies: 10%

        ## using rand to pick items
        # ! # Entertainment 1
        # ! # party supplies 3
        # ! # drinks 5
        # ! # meals 3
        # ! # snacks 3

        @my_snacks = [ Snack.find(rand(Snack.all.length)+1), Snack.find(rand(Snack.all.length)+1), Snack.find(rand(Snack.all.length)+1) ]

        @my_entertainment = [Entertainment.find(rand(Entertainment.all.length)+1)]

        @my_ps = []
        3.times do
            @my_ps.push(PartySupply.find(rand(PartySupply.all.length)+1))

SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

        @my_d = []
        5.times do
            @my_d.push(Drink.find(rand(Drink.all.length)+1))

SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---

        @my_m = []
        3.times do
            @my_m.push(Meal.find(rand(Meal.all.length)+1))